{
  "nav": {
    "about": "About",
    "experience": "Experience",
    "projects": "Projects",
    "contact": "Contact"
  },
  "about": {
    "title": "Hi, I'm {{name}}.",
    "subtitle": "Principal-Level Software Engineer ",
    "tagline": "With a proven track record in AI systems, Azure, and DevOps at enterprise scale.",
    "heading": "About",
    "paragraph1": "I'm a seasoned software engineer with over two decades of experience, including nearly nine years at Microsoft. My career has spanned roles from Technical Evangelist in Developer Experience to Cloud Solution Architect with Global Partner Solutions, culminating as a Senior Software Engineer in Azure Core (One Fleet Partner).",
    "paragraph2": "Throughout my tenure at Microsoft, I've developed deep expertise in Azure cloud engineering, DevOps practices, and AI-driven software development. Notably, I've collaborated closely with the Semantic Kernel and Copilot teams at Microsoft to build cutting-edge AI solutions.",
    "paragraph3": "Prior to Microsoft, I spent 13 years at Fred IT Group as Lead Technical Architect, managing a team of six engineers to design scalable platforms for the pharmacy and healthcare industry.",
    "paragraph4": "With AI now being an integral part of development, I have chosen to look to find solutions that incorporate and are complemented by AI, rather than worrying about what AI will eliminate. With that in mind, I'm intensely focused on mastering and integrating agentic coding tools, empowering cloud engineers to leverage AI proactively and stay ahead.",
    "paragraph5": "Outside of work, I co-parent two teenagers with my partner, endeavour to automate my household, enjoy time with my dog Pip (named after the Python package manager), and perform as a vocalist in a cover band."
  },
  "experience": {
    "title": "Experience",
    "description": "A chronological overview of my professional journey and the technologies I've worked with.",
    "jobs": {
      "azure-core": {
        "description": "Build and maintain critical components for Azure infrastructure. Collaborate closely with the Semantic Kernel and Copilot teams to develop cutting-edge AI solutions and cloud engineering tools."
      },
      "microsoft-cloud": {
        "description": "Developed cloud infrastructure solutions and AI-driven development tools. Focused on scalable cloud services and integration with Microsoft AI platforms."
      },
      "global-partner-solutions": {
        "description": "Led enterprise cloud transformation initiatives and AI solution architecture. Specialized in prompt engineering, Azure cloud architecture, and DevOps practices for enterprise clients."
      },
      "pacific-commerce": {
        "description": "Managed enterprise EDI solutions and e-commerce integrations using Sterling Commerce GENTRAN. Led technical initiatives for B2B data exchange and automated business processes across multiple client environments."
      },
      "microsoft-dx": {
        "description": "Evangelized Microsoft development technologies and platforms to developer communities. Created technical content, delivered presentations, and provided architectural guidance for .NET, Azure, and emerging Microsoft technologies."
      },
      "fred-it-group": {
        "description": "Led a team of six engineers to design scalable platforms for the pharmacy and healthcare industry. Managed platform design, Agile/DevOps/IaC delivery, and team leadership."
      },
      "leadtec-systems": {
        "description": "Developed enterprise web applications and XML-based data integration systems. Built scalable solutions using C#, ASP.NET, and XSLT transformations for business process automation and reporting systems."
      }
    }
  },
  "projects": {
    "title": "Projects",
    "description": "A collection of projects I've built, showcasing different technologies and problem-solving approaches.",
    "items": {
      "internal-ai-code-scanning-platform": {
        "description": "Built a mandatory code analysis platform for Microsoft that automatically scanned commits and PRs for security vulnerabilities, performance issues, best practice violations, and maintainability risks. Integrated static analysis tools like CodeQL with advanced RAG pipelines to process millions of lines of code. Developed extensive prompt engineering solutions and generative UI components to produce consistent insights and reports. Implemented robust prompt evaluation pipelines to detect performance drift and utilized structured outputs with Liquid templates to ensure deterministic, reliable analysis results across the entire Microsoft codebase."
      },
      "microsoft-fabric-data-solutions": {
        "description": "Extended the Microsoft Fabric web interface to provide accelerators and solution templates offering structured foundations for different business domains and industries, including industry-specific schemas, data pipelines, transformation logic, and semantic models."
      },
      "azure-deployment-accelerator-tui": {
        "description": "Developed a bash-based TUI providing guided workflows for Microsoft's internal Azure deployment platform. Streamlined complex deployments through intelligent validation and Dev Container integration, becoming the standard tool across multiple engineering teams."
      },
      "devops-openhack-technical-lead": {
        "description": "Served as Technical Lead for Microsoft coaches working with diverse teams from ISV, Enterprise, Government, SMC, and SMB organizations. After coaching at numerous events, was invited to lead all coaches and provide technical leadership at major DevOps OpenHacks including Microsoft Ready in Seattle, Microsoft Inspire in Las Vegas, GovTech conferences in Canberra, and during Scott Guthrie's keynote at the Microsoft AI Tour in Sydney (February 2024). Guided organizations through DevOps transformation, CI/CD implementation, infrastructure as code, and Azure DevOps adoption at scale."
      },
      "azure-ai-governance-pipeline": {
        "description": "Contributed as part of a crucial DevOps team to the re-implementation of Microsoft's foundational engineering platform for Azure service governance. Delivered infrastructure as code solutions using Bicep and Ev2 to provision this next-generation platform, architected for massive capacity and scale."
      },
      "about-me": {
        "description": "This site - A modern React portfolio website built with TypeScript and Vite, featuring responsive design and internationalization support."
      },
      "glam-mcp": {
        "description": "A Model Context Protocol server that provides intelligent development experiences through rich, contextual responses for AI assistants, transforming AI coding into pair programming with a senior developer."
      },
      "gavin-copilot": {
        "description": "A sample application demonstrating how Semantic Kernel and AI can work in web applications, featuring a React frontend, .NET backend, and Azure OpenAI integration."
      },
      "spec-chain": {
        "description": "A comprehensive system of AI prompts that work together to generate complete product documentation from a single app idea, designed specifically for Claude Code."
      },
      "azure-spa-environment-variables": {
        "description": "A comprehensive guide and implementation for managing environment-specific configurations in client-side React applications deployed to Azure, enabling 'build once, deploy everywhere' workflows."
      },
      "virtual-devbox": {
        "description": "An AutoHotkey script for managing Microsoft Dev Box connections across Windows 11 virtual desktops, providing hotkeys to facilitate seamless switching between local and remote development environments."
      },
      "dial-tray": {
        "description": "A system tray application that provides enhanced Surface Dial control for better integration with development tools like Warp and Claude Code."
      },
      "vs-mobile-center-build": {
        "description": "A custom build task for triggering and managing builds in Visual Studio Mobile Center, with the ability to download build artifacts and integrate with Team Foundation Server pipelines."
      }
    }
  },
  "contact": {
    "title": "Get In Touch",
    "message": "I'm always interested in hearing about new projects and opportunities. Feel free to reach out!",
    "button": "Say Hello",
    "email": "me@simonlamb.codes"
  },
  "common": {
    "visitProject": "Visit {{title}}",
    "viewOnGithub": "{{title}} GitHub repository",
    "toggleMenu": "Toggle navigation menu",
    "close": "Close"
  },
  "language": {
    "switchTo": "Switch to {{language}}",
    "current": "Current language: {{language}}"
  }
}
