{
  "nav": {
    "about": "About",
    "experience": "Experience",
    "projects": "Projects",
    "contact": "Contact"
  },
  "about": {
    "title": "Hi, I'm {{name}}.",
    "subtitle": "Principal-Level Software Engineer ",
    "tagline": "With a proven track record in AI systems, Azure, and DevOps at enterprise scale.",
    "heading": "About",
    "paragraph1": "I'm a seasoned software engineer with over two decades of experience, including nearly nine years at Microsoft. My career has spanned roles from Technical Evangelist in Developer Experience to Cloud Solution Architect with Global Partner Solutions, culminating as a Senior Software Engineer in Azure Core (One Fleet Partner).",
    "paragraph2": "Throughout my tenure at Microsoft, I've developed deep expertise in Azure cloud engineering, DevOps practices, and AI-driven software development. Notably, I've collaborated closely with the Semantic Kernel and Copilot teams at Microsoft to build cutting-edge AI solutions.",
    "paragraph3": "Prior to Microsoft, I spent 13 years at Fred IT Group as Lead Technical Architect, managing a team of six engineers to design scalable platforms for the pharmacy and healthcare industry.",
    "paragraph4": "I'm not worried about AI eliminating software developers - I'm more concerned about developers who aren't using AI being outpaced by those who do. For that reason, I'm intensely focused on mastering and integrating agentic coding tools, empowering cloud engineers to leverage AI proactively and stay ahead.",
    "paragraph5": "Outside of work, I co-parent two teenagers with my partner, endeavour to automate my household, enjoy time with my dog Pip (named after the Python package manager), and perform as a vocalist in a cover band."
  },
  "experience": {
    "title": "Experience",
    "description": "A chronological overview of my professional journey and the technologies I've worked with.",
    "jobs": {
      "azure-core": {
        "description": "Build and maintain critical components for Azure infrastructure. Collaborate closely with the Semantic Kernel and Copilot teams to develop cutting-edge AI solutions and cloud engineering tools."
      },
      "microsoft-cloud": {
        "description": "Developed cloud infrastructure solutions and AI-driven development tools. Focused on scalable cloud services and integration with Microsoft AI platforms."
      },
      "global-partner-solutions": {
        "description": "Led enterprise cloud transformation initiatives and AI solution architecture. Specialized in prompt engineering, Azure cloud architecture, and DevOps practices for enterprise clients."
      },
      "fred-it-group": {
        "description": "Led a team of six engineers to design scalable platforms for the pharmacy and healthcare industry. Managed platform design, Agile/DevOps/IaC delivery, and team leadership."
      }
    }
  },
  "projects": {
    "title": "Projects",
    "description": "A collection of projects I've built, showcasing different technologies and problem-solving approaches.",
    "items": {
      "ecommerce-platform": {
        "description": "A modern e-commerce platform built with Next.js and Stripe integration."
      },
      "task-management-app": {
        "description": "A collaborative task management application with real-time updates."
      },
      "design-system": {
        "description": "A comprehensive design system and component library for enterprise applications."
      }
    }
  },
  "contact": {
    "title": "Get In Touch",
    "message": "I'm always interested in hearing about new projects and opportunities. Feel free to reach out!",
    "button": "Say Hello",
    "email": "me@simonlamb.codes"
  },
  "common": {
    "visitProject": "Visit {{title}}",
    "viewOnGithub": "{{title}} GitHub repository",
    "toggleMenu": "Toggle navigation menu",
    "close": "Close"
  },
  "language": {
    "switchTo": "Switch to {{language}}",
    "current": "Current language: {{language}}"
  }
}
