{
  "nav": {
    "about": "About",
    "experience": "Experience",
    "projects": "Projects",
    "contact": "Contact"
  },
  "about": {
    "title": "Hi, I'm {{name}}.",
    "subtitle": "Principal AI/Software Engineer | GenAI/RAG, LLMOps, SRE",
    "tagline": "I build production GenAI platforms on Microsoft Azure and bring DevOps leadership from the ground up.",
    "heading": "About",
    "paragraph1": "I build production GenAI platforms on Microsoft Azure and bring DevOps leadership from the ground up. Recently, I focused on LLM platform engineering inside Microsoft Azure Core, where I delivered AI systems with full LLMOps/MLOps rigor—CI/CD, evaluation pipelines, guardrails, observability, and cost/latency governance.",
    "paragraph2": "Azure Core: I engineered a platform that applied Azure OpenAI + agentic retrieval to analyse internal Microsoft product codebases. The goal: automatically surface security, performance, and best-practice risks before rollout. This strengthened governance and reduced incidents from problematic deployments. With code contexts spanning thousands of lines, I designed token-aware batching, caching, and aggregation strategies that made multi-chunk evaluation feasible and cost-effective. I embedded automatic + human-in-the-loop eval gates, enabling multiple developers to iterate safely on prompt designs without regressions.",
    "paragraph3": "Global Partner Solutions (CSA): Before Azure Core, I partnered with enterprises and ISVs to modernise workloads onto Azure (AKS, App Services, Front Door, Private Link) and accelerate GenAI adoption (Databricks, MLflow, Semantic Kernel). I ran workshops, design reviews, and enablement that reduced prototype-to-production cycles from months to weeks.",
    "paragraph4": "Developer Experience & OpenHack: Earlier at Microsoft, I served as Technical Evangelist and later DevOps OpenHack Tech Lead. I led global OpenHacks in Melbourne, Sydney (with Satya Nadella's ANZ visit), Canberra, Las Vegas (Inspire/Ready), and Seattle (TechReady), directing coach teams and mentoring hundreds of engineers. Across these events, I achieved near-perfect satisfaction scores (~95%+) while enabling partners like ANZ, Deloitte, EY, KPMG, Accenture, PwC, Seek, and MYOB.",
    "paragraph5": "DevOps pedigree: My roots are in Fred IT Group, where I was Tech Architect/DevOps Lead for regulated healthcare platforms, embedding SRE practices (SLOs/SLIs, error budgets), IaC, and CI/CD to deliver clinical-grade reliability. Core stack: Azure OpenAI, RAG (vector/hybrid), Semantic Kernel/LangChain, Azure AI Search, Databricks/Delta/Unity Catalog, MLflow, Azure ML, AKS, GitHub Actions/Azure DevOps, Bicep/Terraform, GitOps (Flux/Argo), OPA/Azure Policy, Managed Identity/Key Vault, Azure Monitor/Grafana/Prometheus, SRE practices, Python, C#.",
    "paragraph6": "I'm open to Senior AI Engineer / Senior Data Scientist (GenAI) / Principal Engineer roles in Melbourne, where I can apply my mix of AI platform engineering + DevOps leadership to deliver impact at scale."
  },
  "experience": {
    "title": "Experience",
    "description": "A chronological overview of my professional journey and the technologies I've worked with.",
    "jobs": {
      "azure-core": {
        "description": "Lead development of an AI-powered code security analysis platform used by a significant portion of Azure products to identify security vulnerabilities, performance bottlenecks, and best practice violations in code deployed to Microsoft Cloud Platform. This platform evolved into a comprehensive governance and review system, becoming fundamental to all internal Microsoft product deployments for incident reduction and enterprise risk management."
      },
      "microsoft-cloud": {
        "description": "Extended Microsoft Fabric's native capabilities by implementing the Data Solution framework, delivering domain-specific solutions and industry accelerators across Microsoft Clouds. Specialized in developing internal tooling to enhance deployment consistency and velocity using Microsoft's proprietary delivery frameworks, significantly improving engineering efficiency across Azure teams."
      },
      "global-partner-solutions": {
        "description": "Partnered with Microsoft customers and partners to architect and build enterprise solutions on Azure, ensuring adherence to the Well-Architected Framework and maximizing Azure Marketplace opportunities. Leveraged extensive cross-technology expertise to guide complex implementations while championing DevOps adoption through direct consulting and scale programs including the DevOps OpenHack initiative."
      },
      "pacific-commerce": {
        "description": "Managed enterprise EDI solutions and e-commerce integrations using Sterling Commerce GENTRAN. Led technical initiatives for B2B data exchange and automated business processes across multiple client environments."
      },
      "microsoft-dx": {
        "description": "Evangelized Microsoft development technologies to global developer communities through technical content creation, conference presentations, and architectural guidance for .NET, Azure, and emerging technologies. Recognized as a primary DevOps subject matter expert within Microsoft, supporting enterprise customers and partners in their DevOps transformation journeys."
      },
      "fred-it-group": {
        "description": "Led a team of six engineers developing mission-critical platforms for pharmacy and healthcare sectors. Architected and delivered industry-leading applications for pharmacy dispensing, store operations, and group management built on Microsoft Dynamics AX platform. Championed Agile methodologies and DevOps practices, establishing infrastructure-as-code standards that transformed delivery capabilities."
      },
      "leadtec-systems": {
        "description": "Architected and implemented the Intouch platform, an enterprise-scale retail management system adopted by Australia's largest retailers including Coles Myer (Myer, Coles, Target, Officeworks), David Jones, and Bunnings. Built sophisticated XML-based data integration systems and web applications using C#, ASP.NET, and XSLT transformations to enable real-time business process automation and reporting across thousands of retail locations."
      }
    }
  },
  "projects": {
    "title": "Projects",
    "description": "A collection of projects I've built, showcasing different technologies and problem-solving approaches.",
    "items": {
      "internal-ai-code-scanning-platform": {
        "description": "Built a mandatory code analysis platform for Microsoft that automatically scanned commits and PRs for security vulnerabilities, performance issues, best practice violations, and maintainability risks. Integrated static analysis tools like CodeQL with advanced RAG pipelines to process millions of lines of code. Developed extensive prompt engineering solutions and generative UI components to produce consistent insights and reports. Implemented robust prompt evaluation pipelines to detect performance drift and utilized structured outputs with Liquid templates to ensure deterministic, reliable analysis results across the entire Microsoft codebase."
      },
      "microsoft-fabric-data-solutions": {
        "description": "Extended the Microsoft Fabric web interface to provide accelerators and solution templates offering structured foundations for different business domains and industries, including industry-specific schemas, data pipelines, transformation logic, and semantic models."
      },
      "azure-deployment-accelerator-tui": {
        "description": "Developed a bash-based TUI providing guided workflows for Microsoft's internal Azure deployment platform. Streamlined complex deployments through intelligent validation and Dev Container integration, becoming the standard tool across multiple engineering teams."
      },
      "devops-openhack-technical-lead": {
        "description": "Served as Tech Lead for Microsoft's global DevOps OpenHack program, leading events in Melbourne, Sydney (with Satya Nadella's ANZ visit), Canberra Government, Las Vegas (Inspire/Ready), and Seattle (TechReady). Directed international coaching teams of 10+ Microsoft engineers and mentored hundreds of attendees from partners like Telstra, NSW Health, CBA, ANZ, Deloitte, EY, KPMG, Accenture, PwC, Seek, and MYOB. Achieved consistently high participant satisfaction (~95%+) with immediate improvements in DevOps practices and cloud adoption."
      },
      "azure-ai-governance-pipeline": {
        "description": "Contributed as part of a crucial DevOps team to the re-implementation of Microsoft's foundational engineering platform for Azure service governance. Delivered infrastructure as code solutions using Bicep and Ev2 to provision this next-generation platform, architected for massive capacity and scale."
      },
      "azure-llm-governance": {
        "description": "Engineered an LLM-driven governance platform at Microsoft Azure Core that analyzes internal product codebases to surface security, performance, and best-practice risks before rollout. Implemented token-aware batching, caching, and aggregation strategies for processing thousands of lines of code. Built structured outputs with Liquid templates for hallucination-free reports and embedded human-in-the-loop evaluation gates for safe prompt iteration."
      },
      "healthcare-platform-fred": {
        "description": "Led a team of 6 engineers at Fred IT Group to design and deliver a dispensing and store-management platform for major pharmacy groups. Built on .NET, SQL Server, and Microsoft Dynamics AX, optimized for clinical-grade reliability with SLO/SLI monitoring, error budgets, and blue/green deployments. Implemented robust pipelines for ingesting monthly PBS updates critical to pharmacy compliance."
      },
      "about-me": {
        "description": "This site - A modern React portfolio website built with TypeScript and Vite, featuring responsive design and internationalization support."
      },
      "glam-mcp": {
        "description": "A Model Context Protocol server that provides intelligent development experiences through rich, contextual responses for AI assistants, transforming AI coding into pair programming with a senior developer."
      },
      "gavin-copilot": {
        "description": "A sample application demonstrating how Semantic Kernel and AI can work in web applications, featuring a React frontend, .NET backend, and Azure OpenAI integration."
      },
      "spec-chain": {
        "description": "A comprehensive system of AI prompts that work together to generate complete product documentation from a single app idea, designed specifically for Claude Code."
      },
      "azure-spa-environment-variables": {
        "description": "A comprehensive guide and implementation for managing environment-specific configurations in client-side React applications deployed to Azure, enabling 'build once, deploy everywhere' workflows."
      },
      "virtual-devbox": {
        "description": "An AutoHotkey script for managing Microsoft Dev Box connections across Windows 11 virtual desktops, providing hotkeys to facilitate seamless switching between local and remote development environments."
      },
      "dial-tray": {
        "description": "A system tray application that provides enhanced Surface Dial control for better integration with development tools like Warp and Claude Code."
      },
      "vs-mobile-center-build": {
        "description": "A custom build task for triggering and managing builds in Visual Studio Mobile Center, with the ability to download build artifacts and integrate with Team Foundation Server pipelines."
      }
    }
  },
  "contact": {
    "title": "Get In Touch",
    "message": "I'm always interested in hearing about new projects and opportunities. Feel free to reach out!",
    "button": "Say Hello",
    "email": "me@simonlamb.codes"
  },
  "common": {
    "visitProject": "Visit {{title}}",
    "viewOnGithub": "{{title}} GitHub repository",
    "toggleMenu": "Toggle navigation menu",
    "close": "Close"
  },
  "language": {
    "switchTo": "Switch to {{language}}",
    "current": "Current language: {{language}}"
  }
}
