{
  "nav": {
    "about": "About",
    "experience": "Experience",
    "projects": "Projects",
    "contact": "Contact"
  },
  "about": {
    "title": "Hi, I'm {{name}}.",
    "subtitle": "Principal AI Engineer | DevOps Advocate",
    "tagline": "",
    "heading": "About",
    "paragraph1": "I am a seasoned software engineer with over two decades of experience delivering scalable, impactful solutions - nearly nine of those years spent at Microsoft. My journey has spanned diverse roles: from Technical Evangelist in Developer Experience, to Cloud Solution Architect with Global Partner Solutions, to Senior Software Engineer in Azure Core (One Fleet Partner). During my time in Azure Engineering, I built real products powered by generative AI, gaining deep expertise in prompt engineering, RAG pipelines, model evaluation, and the unique challenges of productionizing AI systems - from managing non-deterministic outputs to implementing robust evaluation frameworks and ensuring reliability at scale.",
    "paragraph2": "Over the years, I've developed extensive expertise in DevOps, both in mastering the tooling ecosystem (CI/CD pipelines, infrastructure-as-code, observability platforms, release automation) and in championing the principles that make DevOps transformative - continuous improvement, collaboration, automation, and measurement. I've helped teams modernize their engineering practices to achieve faster delivery cycles, higher reliability, and stronger alignment between development and operations.",
    "paragraph3": "What excites me most today is the evolving role of AI in engineering and product design. I'm passionate about how intelligent tools can accelerate coding, testing, and architecture, while also unlocking new product capabilities that create meaningful impact for customers. I see AI not just as a way to boost productivity, but as a collaborator that helps engineers and organizations innovate faster and with greater creativity.",
    "paragraph4": "Prior to Microsoft, I spent 13 years at Fred IT Group as Lead Technical Architect, managing a team of six engineers to design scalable platforms for the pharmacy and healthcare industry.",
    "paragraph5": "Outside of work, I co-parent two teenagers with my partner, endeavour to automate my household, enjoy time with my dog Pip (named after the Python package manager), and perform as a vocalist in a cover band."
  },
  "experience": {
    "title": "Experience",
    "description": "A chronological overview of my professional journey and the technologies I've worked with.",
    "jobs": {
      "azure-core": {
        "description": "Lead development of an AI-powered code security analysis platform used by a significant portion of Azure products to identify security vulnerabilities, performance bottlenecks, and best practice violations in code deployed to Microsoft Cloud Platform. This platform evolved into a comprehensive governance and review system, becoming fundamental to all internal Microsoft product deployments for incident reduction and enterprise risk management."
      },
      "microsoft-cloud": {
        "description": "Extended Microsoft Fabric's native capabilities by implementing the Data Solution framework, delivering domain-specific solutions and industry accelerators across Microsoft Clouds. Specialized in developing internal tooling to enhance deployment consistency and velocity using Microsoft's proprietary delivery frameworks, significantly improving engineering efficiency across Azure teams."
      },
      "global-partner-solutions": {
        "description": "Partnered with Microsoft customers and partners to architect and build enterprise solutions on Azure, ensuring adherence to the Well-Architected Framework and maximizing Azure Marketplace opportunities. Leveraged extensive cross-technology expertise to guide complex implementations while championing DevOps adoption through direct consulting and scale programs including the DevOps OpenHack initiative."
      },
      "pacific-commerce": {
        "description": "Managed enterprise EDI solutions and e-commerce integrations using Sterling Commerce GENTRAN. Led technical initiatives for B2B data exchange and automated business processes across multiple client environments."
      },
      "microsoft-dx": {
        "description": "Evangelized Microsoft development technologies to global developer communities through technical content creation, conference presentations, and architectural guidance for .NET, Azure, and emerging technologies. Recognized as a primary DevOps subject matter expert within Microsoft, supporting enterprise customers and partners in their DevOps transformation journeys."
      },
      "fred-it-group": {
        "description": "Led a team of six engineers developing mission-critical platforms for pharmacy and healthcare sectors. Architected and delivered industry-leading applications for pharmacy dispensing, store operations, and group management built on Microsoft Dynamics AX platform. Championed Agile methodologies and DevOps practices, establishing infrastructure-as-code standards that transformed delivery capabilities."
      },
      "leadtec-systems": {
        "description": "Architected and implemented the Intouch platform, an enterprise-scale retail management system adopted by Australia's largest retailers including Coles Myer (Myer, Coles, Target, Officeworks), David Jones, and Bunnings. Built sophisticated XML-based data integration systems and web applications using C#, ASP.NET, and XSLT transformations to enable real-time business process automation and reporting across thousands of retail locations."
      }
    }
  },
  "projects": {
    "title": "Projects",
    "description": "A collection of projects I've built, showcasing different technologies and problem-solving approaches.",
    "items": {
      "internal-ai-code-scanning-platform": {
        "description": "Built a mandatory code analysis platform for Microsoft that automatically scanned commits and PRs for security vulnerabilities, performance issues, best practice violations, and maintainability risks. Integrated static analysis tools like CodeQL with advanced RAG pipelines to process millions of lines of code. Developed extensive prompt engineering solutions and generative UI components to produce consistent insights and reports. Implemented robust prompt evaluation pipelines to detect performance drift and utilized structured outputs with Liquid templates to ensure deterministic, reliable analysis results across the entire Microsoft codebase."
      },
      "microsoft-fabric-data-solutions": {
        "description": "Extended the Microsoft Fabric web interface to provide accelerators and solution templates offering structured foundations for different business domains and industries, including industry-specific schemas, data pipelines, transformation logic, and semantic models."
      },
      "azure-deployment-accelerator-tui": {
        "description": "Developed a bash-based TUI providing guided workflows for Microsoft's internal Azure deployment platform. Streamlined complex deployments through intelligent validation and Dev Container integration, becoming the standard tool across multiple engineering teams."
      },
      "devops-openhack-technical-lead": {
        "description": "Served as Technical Lead for Microsoft coaches working with diverse teams from ISV, Enterprise, Government, SMC, and SMB organizations. After coaching at numerous events, was invited to lead all coaches and provide technical leadership at major DevOps OpenHacks including Microsoft Ready in Seattle, Microsoft Inspire in Las Vegas, GovTech conferences in Canberra, and during Scott Guthrie's keynote at the Microsoft AI Tour in Sydney (February 2024). Guided organizations through DevOps transformation, CI/CD implementation, infrastructure as code, and Azure DevOps adoption at scale."
      },
      "azure-ai-governance-pipeline": {
        "description": "Contributed as part of a crucial DevOps team to the re-implementation of Microsoft's foundational engineering platform for Azure service governance. Delivered infrastructure as code solutions using Bicep and Ev2 to provision this next-generation platform, architected for massive capacity and scale."
      },
      "about-me": {
        "description": "This site - A modern React portfolio website built with TypeScript and Vite, featuring responsive design and internationalization support."
      },
      "glam-mcp": {
        "description": "A Model Context Protocol server that provides intelligent development experiences through rich, contextual responses for AI assistants, transforming AI coding into pair programming with a senior developer."
      },
      "gavin-copilot": {
        "description": "A sample application demonstrating how Semantic Kernel and AI can work in web applications, featuring a React frontend, .NET backend, and Azure OpenAI integration."
      },
      "spec-chain": {
        "description": "A comprehensive system of AI prompts that work together to generate complete product documentation from a single app idea, designed specifically for Claude Code."
      },
      "azure-spa-environment-variables": {
        "description": "A comprehensive guide and implementation for managing environment-specific configurations in client-side React applications deployed to Azure, enabling 'build once, deploy everywhere' workflows."
      },
      "virtual-devbox": {
        "description": "An AutoHotkey script for managing Microsoft Dev Box connections across Windows 11 virtual desktops, providing hotkeys to facilitate seamless switching between local and remote development environments."
      },
      "dial-tray": {
        "description": "A system tray application that provides enhanced Surface Dial control for better integration with development tools like Warp and Claude Code."
      },
      "vs-mobile-center-build": {
        "description": "A custom build task for triggering and managing builds in Visual Studio Mobile Center, with the ability to download build artifacts and integrate with Team Foundation Server pipelines."
      }
    }
  },
  "contact": {
    "title": "Get In Touch",
    "message": "I'm always interested in hearing about new projects and opportunities. Feel free to reach out!",
    "button": "Say Hello",
    "email": "me@simonlamb.codes"
  },
  "common": {
    "visitProject": "Visit {{title}}",
    "viewOnGithub": "{{title}} GitHub repository",
    "toggleMenu": "Toggle navigation menu",
    "close": "Close"
  },
  "language": {
    "switchTo": "Switch to {{language}}",
    "current": "Current language: {{language}}"
  }
}
