{
  "nav": {
    "about": "Acerca de",
    "experience": "Experiencia",
    "projects": "Proyectos",
    "contact": "Contacto"
  },
  "about": {
    "title": "Hola, soy {{name}}.",
    "subtitle": "Ingeniero Frontend Senior",
    "tagline": "Construyo experiencias digitales perfectas, atractivas y accesibles.",
    "heading": "Acerca de",
    "paragraph1": "Soy un desarrollador full-stack apasionado con más de 5 años de experiencia construyendo experiencias digitales. Me especializo en crear aplicaciones web accesibles y perfectas con tecnologías modernas.",
    "paragraph2": "Mi enfoque principal en estos días es construir productos y liderar proyectos en Upstatement. Lo que más disfruto es construir software en el punto dulce donde el diseño y la ingeniería se encuentran: cosas que se ven bien pero también están bien construidas por dentro.",
    "paragraph3": "Cuando no estoy en la computadora, generalmente estoy escalando rocas, pasando tiempo con mi esposa y dos gatos, o corriendo por Hyrule buscando semillas Korok."
  },
  "experience": {
    "title": "Experiencia",
    "description": "Una visión cronológica de mi trayectoria profesional y las tecnologías con las que he trabajado.",
    "jobs": {
      "azure-core": {
        "description": "Construir y mantener componentes críticos para la infraestructura de Azure. Colaborar estrechamente con los equipos de Semantic Kernel y Copilot para desarrollar soluciones de IA de vanguardia y herramientas de ingeniería en la nube."
      },
      "microsoft-cloud": {
        "description": "Desarrollé soluciones de infraestructura en la nube y herramientas de desarrollo impulsadas por IA. Me enfoqué en servicios en la nube escalables e integración con plataformas de IA de Microsoft."
      },
      "global-partner-solutions": {
        "description": "Lideré iniciativas de transformación empresarial en la nube y arquitectura de soluciones de IA. Me especialicé en ingeniería de prompts, arquitectura de nube de Azure y prácticas de DevOps para clientes empresariales."
      },
      "fred-it-group": {
        "description": "Lideré un equipo de seis ingenieros para diseñar plataformas escalables para la industria farmacéutica y de atención médica. Gestioné el diseño de plataformas, la entrega de Agile/DevOps/IaC y el liderazgo del equipo."
      }
    }
  },
  "projects": {
    "title": "Proyectos",
    "description": "Una colección de proyectos que he construido, mostrando diferentes tecnologías y enfoques de resolución de problemas.",
    "items": {
      "ecommerce-platform": {
        "description": "Una plataforma de comercio electrónico moderna construida con Next.js e integración con Stripe."
      },
      "task-management-app": {
        "description": "Una aplicación colaborativa de gestión de tareas con actualizaciones en tiempo real."
      },
      "design-system": {
        "description": "Un sistema de diseño integral y biblioteca de componentes para aplicaciones empresariales."
      }
    }
  },
  "contact": {
    "title": "Ponte en Contacto",
    "message": "Siempre estoy interesado en conocer nuevos proyectos y oportunidades. ¡No dudes en contactarme!",
    "button": "Di Hola",
    "email": "hello@example.com"
  },
  "common": {
    "visitProject": "Visitar {{title}}",
    "viewOnGithub": "Repositorio de GitHub de {{title}}",
    "toggleMenu": "Alternar menú de navegación",
    "close": "Cerrar"
  },
  "language": {
    "switchTo": "Cambiar a {{language}}",
    "current": "Idioma actual: {{language}}"
  }
}
