{
  "nav": {
    "about": "À propos",
    "experience": "Expérience",
    "projects": "Projets",
    "contact": "Contact"
  },
  "about": {
    "title": "Salut, je suis {{name}}.",
    "subtitle": "Ingénieur Logiciel Principal",
    "tagline": "Avec une expérience prouvée dans les systèmes IA, Azure et DevOps à l'échelle d'entreprise.",
    "heading": "À propos",
    "paragraph1": "Je suis un ingénieur logiciel expérimenté avec plus de deux décennies d'expérience, dont près de neuf ans chez Microsoft. Ma carrière a englobé des rôles d'Évangéliste Technique en Expérience Développeur à Architecte Solutions Cloud avec Global Partner Solutions, culminant en tant qu'Ingénieur Logiciel Senior dans Azure Core (One Fleet Partner).",
    "paragraph2": "Tout au long de mon mandat chez Microsoft, j'ai développé une expertise approfondie en ingénierie cloud Azure, pratiques DevOps et développement logiciel piloté par l'IA. Notamment, j'ai collaboré étroitement avec les équipes Semantic Kernel et Copilot chez Microsoft pour construire des solutions IA de pointe.",
    "paragraph3": "Avant Microsoft, j'ai passé 13 ans chez Fred IT Group en tant qu'Architecte Technique Principal, gérant une équipe de six ingénieurs pour concevoir des plateformes évolutives pour l'industrie pharmaceutique et de la santé.",
    "paragraph4": "Avec l'IA maintenant partie intégrante du développement, j'ai choisi de chercher des solutions qui incorporent et sont complétées par l'IA, plutôt que de m'inquiéter de ce que l'IA éliminera. Dans cet esprit, je me concentre intensément sur la maîtrise et l'intégration d'outils de codage agentiques, permettant aux ingénieurs cloud de tirer parti de l'IA de manière proactive et de rester en avance.",
    "paragraph5": "En dehors du travail, je co-élève deux adolescents avec ma partenaire, m'efforce d'automatiser ma maison, profite du temps avec mon chien Pip (nommé d'après le gestionnaire de paquets Python), et me produis comme chanteur dans un groupe de reprises."
  },
  "experience": {
    "title": "Expérience",
    "description": "Un aperçu chronologique de mon parcours professionnel et des technologies avec lesquelles j'ai travaillé.",
    "jobs": {
      "azure-core": {
        "description": "Construire et maintenir des composants critiques pour l'infrastructure Azure. Collaborer étroitement avec les équipes Semantic Kernel et Copilot pour développer des solutions IA de pointe et des outils d'ingénierie cloud."
      },
      "microsoft-cloud": {
        "description": "Développé des solutions d'infrastructure cloud et des outils de développement alimentés par l'IA. Concentré sur les services cloud évolutifs et l'intégration avec les plateformes IA de Microsoft."
      },
      "global-partner-solutions": {
        "description": "Dirigé des initiatives de transformation cloud d'entreprise et l'architecture de solutions IA. Spécialisé dans l'ingénierie de prompts, l'architecture cloud Azure et les pratiques DevOps pour les clients d'entreprise."
      },
      "pacific-commerce": {
        "description": "Géré des solutions EDI d'entreprise et des intégrations e-commerce utilisant Sterling Commerce GENTRAN. Dirigé des initiatives techniques pour l'échange de données B2B et les processus métier automatisés dans plusieurs environnements clients."
      },
      "microsoft-dx": {
        "description": "Évangélisé les technologies et plateformes de développement Microsoft auprès des communautés de développeurs. Créé du contenu technique, livré des présentations et fourni des conseils architecturaux pour .NET, Azure et les technologies Microsoft émergentes."
      },
      "fred-it-group": {
        "description": "Dirigé une équipe de six ingénieurs pour concevoir des plateformes évolutives pour l'industrie pharmaceutique et de la santé. Géré la conception de plateformes, la livraison Agile/DevOps/IaC et le leadership d'équipe."
      },
      "leadtec-systems": {
        "description": "Développé des applications web d'entreprise et des systèmes d'intégration de données basés sur XML. Construit des solutions évolutives utilisant C#, ASP.NET et les transformations XSLT pour l'automatisation des processus métier et les systèmes de rapport."
      }
    }
  },
  "projects": {
    "title": "Projets",
    "description": "Une collection de projets que j'ai construits, montrant différentes technologies et approches de résolution de problèmes.",
    "items": {
      "about-me": {
        "description": "Ce site - Un site portfolio React moderne construit avec TypeScript et Vite, présentant un design réactif et un support d'internationalisation."
      },
      "glam-mcp": {
        "description": "Un serveur Model Context Protocol qui fournit des expériences de développement intelligentes grâce à des réponses riches et contextuelles pour les assistants IA, transformant le codage IA en programmation en binôme avec un développeur senior."
      },
      "gavin-copilot": {
        "description": "Une application exemple démontrant comment Semantic Kernel et l'IA peuvent fonctionner dans les applications web, présentant un frontend React, un backend .NET et une intégration Azure OpenAI."
      },
      "spec-chain": {
        "description": "Un système complet de prompts IA qui travaillent ensemble pour générer une documentation produit complète à partir d'une seule idée d'application, conçu spécifiquement pour Claude Code."
      },
      "azure-spa-environment-variables": {
        "description": "Un guide complet et une implémentation pour gérer les configurations spécifiques à l'environnement dans les applications React côté client déployées sur Azure, permettant des workflows 'construire une fois, déployer partout'."
      },
      "virtual-devbox": {
        "description": "Un script AutoHotkey pour gérer les connexions Microsoft Dev Box à travers les bureaux virtuels Windows 11, fournissant des raccourcis clavier pour faciliter le basculement transparent entre les environnements de développement locaux et distants."
      },
      "dial-tray": {
        "description": "Une application de barre système qui fournit un contrôle Surface Dial amélioré pour une meilleure intégration avec les outils de développement comme Warp et Claude Code."
      },
      "vs-mobile-center-build": {
        "description": "Une tâche de build personnalisée pour déclencher et gérer les builds dans Visual Studio Mobile Center, avec la capacité de télécharger les artefacts de build et s'intégrer avec les pipelines Team Foundation Server."
      }
    }
  },
  "contact": {
    "title": "Entrer en Contact",
    "message": "Je suis toujours intéressé à entendre parler de nouveaux projets et opportunités. N'hésitez pas à me contacter!",
    "button": "Dire Bonjour",
    "email": "me@simonlamb.codes"
  },
  "common": {
    "visitProject": "Visiter {{title}}",
    "viewOnGithub": "Dépôt GitHub de {{title}}",
    "toggleMenu": "Basculer le menu de navigation",
    "close": "Fermer"
  },
  "language": {
    "switchTo": "Passer à {{language}}",
    "current": "Langue actuelle: {{language}}"
  }
}
