{
  "nav": {
    "about": "À propos",
    "aboutMe": "À Propos de Moi",
    "experience": "Expérience",
    "projects": "Projets",
    "blog": "Perspectives",
    "contact": "Contact"
  },
  "sidebar": {
    "title": "Ingénieur Principal IA/Logiciel | GenAI/RAG, LLMOps, SRE",
    "tagline": "Je construis des plateformes GenAI de production sur Microsoft Azure et apporte un leadership DevOps depuis la base. Spécialisé dans l'ingénierie de plateforme LLM avec une rigueur complète LLMOps/MLOps : CI/CD, pipelines d'évaluation, garde-fous, observabilité et gouvernance des coûts/latence."
  },
  "blog": {
    "title": "Perspectives Techniques"
  },
  "about": {
    "title": "Salut, je suis {{name}}.",
    "subtitle": "",
    "tagline": "Plateformes GenAI, passerelles de commerce électronique ou distribution de médicaments intégrée : j'ai tout livré et opéré, et plus encore. Qu'il s'agisse de cloud natif ou de migration cloud, je dirige toujours avec un état d'esprit DevOps. Les systèmes échouent. Les gagnants apprennent le plus rapidement. Je compresse les boucles de rétroaction, réduis le délai de livraison et diminue le MTTR, sans ralentir la livraison.",
    "heading": "À Propos de Moi",
    "paragraph1": "Je conçois des systèmes IA de production à grande échelle. Chez Microsoft Azure Core, j'ai construit des plateformes qui analysent des millions de lignes de code en utilisant des LLMs pour identifier les risques de sécurité et les problèmes de gouvernance avant le déploiement.",
    "paragraph2": "Mon expertise couvre toute la pile IA : Azure OpenAI, pipelines RAG, LLMOps/MLOps, optimisation des tokens et systèmes d'évaluation avec humain dans la boucle. J'apporte plus de 15 ans de leadership DevOps et de pratiques SRE pour garantir que ces systèmes offrent une fiabilité de niveau clinique.",
    "paragraph3": "Ouvert aux rôles d'Ingénieur Principal où je peux appliquer l'ingénierie de plateforme IA et le leadership DevOps pour générer un impact à grande échelle. Intéressé à discuter d'opportunités? Connectons-nous!",
    "paragraph4": "Au-delà du code, je suis père de deux filles extraordinaires qui comprennent l'importance de ne pas \"faire un clic droit pour publier\". Je suis aussi chanteur et batteur dans un groupe avec d'autres Microsofties appelé \"No Pilots\"—parce que qui a besoin d'un Copilot quand on a DevOps?"
  },
  "experience": {
    "title": "Expérience",
    "description": "Un aperçu chronologique de mon parcours professionnel et des technologies avec lesquelles j'ai travaillé.",
    "jobs": {
      "azure-core": {
        "title": "Ingénieur Logiciel Senior",
        "company": "Microsoft Engineering (Azure Core)",
        "period": "Juil 2024 - Juil 2025",
        "description": "Collaboré avec une équipe d'ingénierie distribuée basée aux États-Unis pour livrer une infrastructure de gouvernance critique pour les déploiements de produits internes Azure. Participé aux cérémonies agiles incluant les standups quotidiens, la planification des sprints et les rétrospectives à travers le fuseau horaire du Pacifique, contribuant aux revues de conception architecturale et aux spécifications techniques.<br/><br/>Travaillé en étroite collaboration avec les chefs de produit, les designers UX et les équipes de sécurité pour définir les exigences et les critères d'acceptation des systèmes d'analyse de code pilotés par IA. Défendu l'excellence en ingénierie grâce à des revues de code rigoureuses, des sessions de programmation en binôme et des présentations de partage de connaissances. Mentoré les ingénieurs juniors sur les meilleures pratiques LLMOps, les techniques d'ingénierie des prompts et les modèles d'intégration Azure OpenAI.<br/><br/>Piloté des initiatives d'amélioration continue incluant l'automatisation des pipelines d'évaluation, les tableaux de bord d'observabilité et les playbooks de réponse aux incidents. Travaillé de manière transversale avec les équipes de la plateforme Azure DevOps pour livrer des expériences d'extension basées sur React, participant aux critiques de conception et aux sessions de tests d'utilisabilité. Défendu le développement piloté par les tests, maintenant des normes élevées de couverture de code et implémentant des suites de tests d'intégration complètes. Contribué à la documentation technique de l'équipe, aux runbooks et aux matériaux d'intégration qui ont permis de diffuser les connaissances à travers l'organisation."
      },
      "microsoft-cloud-industry": {
        "title": "Ingénieur Logiciel Senior",
        "company": "Microsoft Engineering (Microsoft Cloud)",
        "period": "Avr 2024 - Juil 2024",
        "description": "Intégré au sein d'une équipe d'ingénierie basée à Singapour livrant des <a href='https://learn.microsoft.com/fr-fr/industry/industry-data-solutions-fabric' target='_blank' rel='noopener noreferrer' style='color: #38bdf8; text-decoration: underline;'>Solutions Industrielles</a> pour Microsoft Fabric, collaborant à travers les fuseaux horaires Asie-Pacifique avec des ingénieurs à Singapour, en Inde et en Australie. Participé aux cérémonies de sprint, aux sessions de conception technique et aux réunions de raffinement du backlog menées en formats synchrones et asynchrones pour s'adapter à la dynamique d'équipe distribuée.<br/><br/>Travaillé en étroite collaboration avec les responsables produits et l'équipe d'ingénierie principale Microsoft Fabric à Redmond pour aligner les points d'intégration, les contrats d'API et les stratégies de déploiement. Participé aux conseils d'examen d'architecture hebdomadaires présentant des propositions techniques pour les accélérateurs de données spécifiques à l'industrie ciblant les secteurs de la vente au détail, de la fabrication et de la santé. Contribué à la culture d'ingénierie de l'équipe à travers des revues de code mettant l'accent sur les normes du système d'ingénierie de Microsoft pour la sécurité, la performance et l'évolutivité.<br/><br/>Collaboré avec des chercheurs UX et des designers pour valider les modèles de solution à travers des études utilisateurs et des sessions de feedback avec des clients d'entreprise. Défendu les pratiques DevOps incluant le feature flagging, les stratégies de tests automatisés et les approches de déploiement progressif permettant une livraison sûre et incrémentale en production. Mentoré les membres de l'équipe sur les meilleures pratiques React et TypeScript tout en apprenant des ingénieurs seniors sur l'architecture backend .NET et les API internes de Microsoft Fabric. Participé activement aux rotations de réponse aux incidents, contribuant aux post-mortems et aux améliorations de fiabilité."
      },
      "microsoft-cloud": {
        "title": "Ingénieur Logiciel Senior",
        "company": "Microsoft (Fabric Data Solutions)",
        "period": "Avr 2024 - Juil 2025",
        "description": "Développé des solutions d'infrastructure cloud et des outils de développement alimentés par l'IA. Concentré sur les services cloud évolutifs et l'intégration avec les plateformes IA de Microsoft."
      },
      "global-partner-solutions": {
        "title": "Architecte de Solutions Cloud",
        "company": "Microsoft (Global Partner Solutions)",
        "period": "Juil 2019 - Avr 2024",
        "description": "Dirigé des initiatives de transformation cloud d'entreprise et l'architecture de solutions IA. Spécialisé dans l'ingénierie de prompts, l'architecture cloud Azure et les pratiques DevOps pour les clients d'entreprise."
      },
      "pacific-commerce": {
        "title": "Gestionnaire de Solutions",
        "company": "Pacific Commerce",
        "period": "1998 - 2001",
        "description": "Géré des solutions EDI d'entreprise et des intégrations e-commerce utilisant Sterling Commerce GENTRAN. Dirigé des initiatives techniques pour l'échange de données B2B et les processus métier automatisés dans plusieurs environnements clients."
      },
      "microsoft-dx": {
        "title": "Chef Technique DevOps OpenHack (Temps partiel)",
        "company": "Microsoft",
        "period": "Juin 2019 - Sept 2021",
        "description": "En tant que Technical Evangelist et DevOps OpenHack Tech Lead, j'ai évangélisé les technologies de développement Microsoft auprès des communautés mondiales de développeurs. Reconnu comme expert principal DevOps au sein de Microsoft, j'ai dirigé des OpenHacks mondiaux atteignant ~95%+ de satisfaction tout en dirigeant des équipes de coaching internationales et en mentorant des centaines d'ingénieurs."
      },
      "microsoft-evangelist": {
        "title": "Évangéliste Technique",
        "company": "Microsoft (Developer Experience)",
        "period": "Fév 2017 - Juil 2019",
        "description": "J'ai évangélisé les technologies de développement Microsoft auprès des communautés mondiales de développeurs par la création de contenu technique, des présentations de conférences et des conseils architecturaux pour .NET, Azure et les technologies émergentes."
      },
      "fred-it-group": {
        "title": "Chef Architecte Technique / Chef DevOps",
        "company": "Fred IT Group",
        "period": "Juin 2004 - Fév 2017",
        "description": "Dirigé une équipe de six ingénieurs pour concevoir des plateformes évolutives pour l'industrie pharmaceutique et de la santé. Géré la conception de plateformes, la livraison Agile/DevOps/IaC et le leadership d'équipe."
      },
      "leadtec-systems": {
        "title": "Développeur Senior",
        "company": "LeadTec Systems",
        "period": "2001 - 2004",
        "description": "Développé des applications web d'entreprise et des systèmes d'intégration de données basés sur XML. Construit des solutions évolutives utilisant C#, ASP.NET et les transformations XSLT pour l'automatisation des processus métier et les systèmes de rapport."
      }
    }
  },
  "projects": {
    "title": "Projets",
    "description": "Une collection de projets que j'ai construits, montrant différentes technologies et approches de résolution de problèmes.",
    "items": {
      "internal-ai-code-scanning-platform": {
        "title": "Plateforme Interne d'Analyse de Code par IA",
        "description": "J'ai construit une plateforme d'analyse de code obligatoire pour Microsoft qui analysait automatiquement les commits et les PR pour détecter les vulnérabilités de sécurité, les problèmes de performance, les violations des meilleures pratiques et les risques de maintenabilité. J'ai intégré des outils d'analyse statique comme CodeQL avec des pipelines RAG avancés pour traiter des millions de lignes de code."
      },
      "microsoft-fabric-industry-solutions": {
        "title": "Solutions Industrielles Microsoft Fabric - Microsoft Engineering",
        "description": "Architecturé un framework d'accélérateur de solution full-stack pour les <a href='https://learn.microsoft.com/fr-fr/industry/industry-data-solutions-fabric' target='_blank' rel='noopener noreferrer' style='color: #38bdf8; text-decoration: underline;'>Solutions Industrielles</a> utilisant React + TypeScript en frontend avec microservices backend ASP.NET Core. Implémenté des patterns de conception pilotés par le domaine avec CQRS et Event Sourcing pour l'orchestration de pipelines de données à travers les secteurs de la vente au détail, de la fabrication et de la santé.<br/><br/>Construit une bibliothèque de composants React utilisant le pattern Compound Component pour une composition flexible et Render Props pour les préoccupations transversales. Intégré avec les API REST Microsoft Fabric implémentant le pattern circuit breaker et la mise en cache des réponses. Créé des spécifications OpenAPI complètes avec Swashbuckle, permettant la génération automatique de SDK client TypeScript via OpenAPI Generator. Implémenté des feature flags utilisant Azure App Configuration avec rafraîchissement dynamique, permettant un déploiement progressif et des tests A/B.<br/><br/>Construit une stack d'observabilité avec métriques personnalisées Application Insights et tracing distribué avec IDs de corrélation à travers les frontières de service. Établi des pipelines CI/CD avec Azure DevOps utilisant des modèles YAML et provisionnement d'infrastructure via Bicep avec fichiers de paramètres spécifiques à l'environnement."
      },
      "azure-deployment-accelerator-tui": {
        "title": "Accélérateur de Déploiement Azure TUI",
        "description": "Développement d'une interface TUI basée sur bash fournissant des flux de travail guidés pour la plateforme de déploiement Azure interne de Microsoft. Déploiements complexes rationalisés grâce à une validation intelligente et une intégration Dev Container, devenant l'outil standard dans plusieurs équipes d'ingénierie."
      },
      "devops-openhack-technical-lead": {
        "title": "Chef Technique DevOps OpenHack - Événements Mondiaux",
        "description": "J'ai servi en tant que Tech Lead pour le programme global DevOps OpenHack de Microsoft, dirigeant des événements à Melbourne, Sydney (avec la visite ANZ de Satya Nadella), Canberra Government, Las Vegas (Inspire/Ready) et Seattle (TechReady). J'ai dirigé des équipes de coaching internationales de plus de 10 ingénieurs Microsoft et mentoré des centaines de participants."
      },
      "azure-ai-governance-pipeline": {
        "title": "Pipeline de Gouvernance IA Azure",
        "description": "J'ai contribué en tant que membre d'une équipe DevOps cruciale à la réimplémentation de la plateforme d'ingénierie fondamentale de Microsoft pour la gouvernance des services Azure. J'ai livré des solutions d'infrastructure en tant que code utilisant Bicep et Ev2 pour provisionner cette plateforme de nouvelle génération, architecturée pour une capacité et une échelle massives."
      },
      "azure-llm-governance": {
        "title": "Plateforme de Gouvernance Pilotée par LLM - Microsoft Engineering",
        "description": "Architecturé et implémenté une plateforme de gouvernance IA à l'échelle de production utilisant Semantic Kernel en C# pour les workflows d'analyse de code concurrents. Construit sur les modèles Azure OpenAI exploitant Azure AI Search (recherche vectorielle + hybride) avec décomposition de sous-requêtes et exécution parallèle agentique, re-classement et réponses structurées avec citations pour l'ancrage. Implémenté une architecture événementielle pour l'orchestration des tâches, avec gestion des lettres mortes et politiques de retry avec backoff exponentiel.<br/><br/>Conçu un algorithme de traitement par lots sensible aux tokens pour une utilisation optimale de la fenêtre de contexte, permettant le traitement de dépôts de code contenant des millions de lignes de code en lots intelligents. Construit une couche de cache distribué pour les vecteurs d'embedding et les résultats d'analyse intermédiaires, et une couche de consolidation intelligente pour fournir le rapport agrégé. Conçu un système de sortie utilisant OpenAI Structured Outputs et un moteur de template Liquid avec validation JSON Schema, pour garantir des réponses déterministes et analysables et finalement éliminer les hallucinations dans les rapports de gouvernance.<br/><br/>Implémenté un pipeline LLMOps complet avec Azure Evaluation SDK pour le versionnement des prompts, les tests A/B et la détection de régression utilisant des modèles IA comme juge pour l'évaluation. Instrumenté avec OpenTelemetry pour le tracing distribué et des tableaux de bord Grafana pour l'observabilité en temps réel."
      },
      "azure-devops-governance-extensions": {
        "title": "Extensions de Gouvernance Azure DevOps - Microsoft Engineering",
        "description": "Construit des extensions Azure DevOps à l'échelle entreprise utilisant React avec TypeScript, exploitant le modèle de contribution de l'<a href='https://learn.microsoft.com/fr-fr/azure/devops/extend/reference/targets/overview?toc=%2Fazure%2Fdevops%2Fmarketplace-extensibility%2Ftoc.json&view=azure-devops' target='_blank' rel='noopener noreferrer' style='color: #38bdf8; text-decoration: underline;'>Azure DevOps Extension SDK</a> pour les points d'intégration Build, PR et Dashboard. Architecturé utilisant le pattern Flux avec Redux Toolkit pour une gestion d'état prévisible à travers des workflows UI complexes couvrant plusieurs panneaux et contextes.<br/><br/>Construit une synchronisation de données en temps réel utilisant des connexions WebSocket SignalR avec logique de reconnexion automatique et mises à jour UI optimistes. Conçu une bibliothèque de composants réactifs utilisant CSS Grid et Flexbox avec approche mobile-first, assurant une UX cohérente sur tous les appareils. Implémenté un pattern de frontière d'erreur complet avec intégration de télémétrie, capturant les exceptions côté client vers Application Insights avec enrichissement de trace de pile.<br/><br/>Créé des hooks React personnalisés pour les interactions avec l'API REST Azure DevOps avec rafraîchissement automatique de token, déduplication de requêtes et retry intelligent avec backoff exponentiel. Optimisé la taille du bundle via code-splitting, tree-shaking et imports dynamiques. Construit via Azure DevOps Pipelines exécutant des tests extensifs et des objectifs de couverture de code. Déployé via Azure DevOps Pipelines avec packaging d'extension automatisé, signature et déploiement progressif à travers les anneaux de validation. Instrumenté avec événements de télémétrie personnalisés suivant l'engagement utilisateur, l'adoption des fonctionnalités et les métriques de performance, alimentant les tableaux de bord Product Analytics pour une itération basée sur les données."
      },
      "healthcare-platform-fred": {
        "title": "Plateforme de Santé Réglementée - Fred IT Group",
        "description": "J'ai dirigé une équipe de 6 ingénieurs chez Fred IT Group pour concevoir et livrer une plateforme de dispensation et de gestion de magasin pour les grands groupes pharmaceutiques. Construit sur .NET, SQL Server et Microsoft Dynamics AX, optimisé pour une fiabilité de qualité clinique avec surveillance SLO/SLI, budgets d'erreur et déploiements bleu/vert."
      },
      "about-me": {
        "title": "simonlamb.codes - Blog et Bio",
        "description": "Ce site - Un portfolio et blog React moderne construit avec TypeScript et Vite, présentant un design réactif, un support d'internationalisation et une biographie professionnelle complète."
      },
      "glam-mcp": {
        "title": "Serveur GLAM MCP",
        "description": "Un serveur Model Context Protocol qui fournit des expériences de développement intelligentes grâce à des réponses riches et contextuelles pour les assistants IA, transformant le codage IA en programmation en binôme avec un développeur senior."
      },
      "gavin-copilot": {
        "title": "Gavin Copilot",
        "description": "Une application exemple démontrant comment Semantic Kernel et l'IA peuvent fonctionner dans les applications web, présentant un frontend React, un backend .NET et une intégration Azure OpenAI."
      },
      "spec-chain": {
        "title": "Chaîne de Spécifications",
        "description": "Un système complet de prompts IA qui travaillent ensemble pour générer une documentation produit complète à partir d'une seule idée d'application, conçu spécifiquement pour Claude Code."
      },
      "devsolo": {
        "title": "devsolo - Plugin d'Historique Linéaire et MCP",
        "description": "Un plugin Claude Code qui rationalise les flux de travail Git via le Model Context Protocol (MCP). Propose un déploiement en une commande (/devsolo:ship) qui gère l'ensemble du pipeline de déploiement—commit, push, création de pull requests, surveillance CI, fusion automatique et nettoyage. Applique un historique linéaire, prévient les conflits de fusion et permet des flux de travail de branches de fonctionnalités simultanées avec gestion de session."
      },
      "azure-spa-environment-variables": {
        "title": "Variables d'Environnement Azure SPA",
        "description": "Un guide complet et une implémentation pour gérer les configurations spécifiques à l'environnement dans les applications React côté client déployées sur Azure, permettant des workflows 'construire une fois, déployer partout'."
      },
      "virtual-devbox": {
        "title": "DevBox Virtuel",
        "description": "Un script AutoHotkey pour gérer les connexions Microsoft Dev Box à travers les bureaux virtuels Windows 11, fournissant des raccourcis clavier pour faciliter le basculement transparent entre les environnements de développement locaux et distants."
      },
      "dial-tray": {
        "title": "Plateau Dial",
        "description": "Une application de barre système qui fournit un contrôle Surface Dial amélioré pour une meilleure intégration avec les outils de développement comme Warp et Claude Code."
      },
      "vs-mobile-center-build": {
        "title": "Build VS Mobile Center",
        "description": "Une tâche de build personnalisée pour déclencher et gérer les builds dans Visual Studio Mobile Center, avec la capacité de télécharger les artefacts de build et s'intégrer avec les pipelines Team Foundation Server."
      }
    }
  },
  "contact": {
    "title": "Entrer en Contact",
    "message": "Je suis toujours intéressé à entendre parler de nouveaux projets et opportunités. N'hésitez pas à me contacter!",
    "button": "Dire Bonjour",
    "email": "me@simonlamb.codes"
  },
  "common": {
    "visitProject": "Visiter {{title}}",
    "viewOnGithub": "Dépôt GitHub de {{title}}",
    "toggleMenu": "Basculer le menu de navigation",
    "close": "Fermer",
    "downloadResume": "Télécharger le CV",
    "featured": "En vedette",
    "highlight": "Point fort",
    "loading": "Chargement...",
    "failedToLoad": "Échec du chargement",
    "months": {
      "jan": "Jan",
      "feb": "Fév",
      "mar": "Mar",
      "apr": "Avr",
      "may": "Mai",
      "jun": "Juin",
      "jul": "Juil",
      "aug": "Août",
      "sep": "Sept",
      "oct": "Oct",
      "nov": "Nov",
      "dec": "Déc"
    },
    "present": "Présent"
  },
  "language": {
    "switchTo": "Passer à {{language}}",
    "current": "Langue actuelle: {{language}}"
  },
  "technologies": {
    "Azure OpenAI": "Azure OpenAI",
    "RAG/Vector Search": "RAG/Recherche Vectorielle",
    "LLMOps/MLOps": "LLMOps/MLOps",
    "Semantic Kernel": "Semantic Kernel",
    "Python": "Python",
    "C#": "C#",
    "Liquid Templates": "Modèles Liquid",
    "Structured Outputs": "Sorties Structurées",
    "Databricks": "Databricks",
    "MLflow": "MLflow",
    "AKS": "AKS",
    "Azure DevOps": "Azure DevOps",
    "Bicep/Terraform": "Bicep/Terraform",
    "GitOps": "GitOps",
    "CI/CD": "CI/CD",
    "IaC": "IaC",
    "SRE": "SRE",
    "GitHub Actions": "Actions GitHub",
    "Docker": "Docker",
    "Kubernetes": "Kubernetes",
    "Technical Coaching": "Coaching Technique",
    "ASP.NET": "ASP.NET",
    "Javascript": "Javascript",
    "Azure": "Azure",
    "DevOps": "DevOps",
    "ARM": "ARM",
    "Node.js": "Node.js",
    "PowerShell": "PowerShell",
    "SQL Server": "SQL Server",
    "Microsoft Dynamics AX": "Microsoft Dynamics AX",
    ".NET": ".NET",
    "Prometheus": "Prometheus",
    "Grafana": "Grafana",
    "OPA/Azure Policy": "OPA/Politique Azure",
    "XML": "XML",
    "XSLT": "XSLT",
    "Web Services": "Services Web",
    "React": "React",
    "TypeScript": "TypeScript",
    "Tailwind CSS": "Tailwind CSS",
    "Vite": "Vite",
    "i18n": "i18n",
    "Claude Code": "Claude Code",
    "GitHub": "GitHub",
    "AutoHotkey": "AutoHotkey",
    "Windows 11": "Windows 11",
    "System Tray": "Barre Système",
    "VSMC": "VSMC",
    "TFS": "TFS",
    "EDI": "EDI",
    "Sterling Commerce": "Sterling Commerce",
    "GENTRAN": "GENTRAN",
    "B2B": "B2B",
    "C#/.NET": "C#/.NET",
    "Visual Basic": "Visual Basic",
    "SQL": "SQL",
    "Bash": "Bash",
    "Dev Container": "Conteneur de Développement",
    "Internal Tooling": "Outils Internes",
    "Melbourne/Sydney/Canberra": "Melbourne/Sydney/Canberra",
    "Las Vegas/Seattle": "Las Vegas/Seattle",
    "Hackathons": "Hackathons",
    "Pharmacy Dispensing": "Dispensation Pharmaceutique",
    "PBS": "PBS",
    "Blue/Green Deployment": "Déploiement Bleu/Vert",
    "Markdown": "Markdown",
    "AI Documentation": "Documentation IA",
    "JavaScript": "JavaScript",
    "MCP": "MCP",
    "RDP": "RDP",
    "Surface Dial": "Surface Dial",
    "Windows": "Windows",
    "Azure Mobile Center": "Azure Mobile Center",
    "Azure Artifacts": "Azure Artifacts",
    "Azure DevOps Extensions": "Extensions Azure DevOps",
    "Microsoft Fabric": "Microsoft Fabric",
    "Industry Solutions": "Solutions Industrielles",
    "Azure DevOps Extension SDK": "SDK d'Extension Azure DevOps",
    "REST APIs": "APIs REST",
    "Performance Optimization": "Optimisation de Performance",
    "Scale Engineering": "Ingénierie d'Échelle",
    "Token-Aware Batching": "Traitement par Lots Sensible aux Tokens",
    "Multi-Chunk Evaluation": "Évaluation Multi-Chunks",
    "Human-in-the-Loop Gates": "Portes Humain-dans-la-Boucle",
    "Cost/Latency Optimization": "Optimisation Coût/Latence",
    "Security Risk Analysis": "Analyse des Risques de Sécurité",
    "Security Best Practices": "Meilleures Pratiques de Sécurité"
  }
}
